Revit 2027 API
Speckle.SpeckleSize Property
 The property labeled "Size" from the "Speckle" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SpeckleSize { get; }
Public Shared ReadOnly Property SpeckleSize As String
	Get
public:
static property String^ SpeckleSize {
	String^ get ();
}
static member SpeckleSize : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 100".
See Also
Reference
Speckle Class
Autodesk.Revit.DB.Visual Namespace